var map = new BMap.Map("myMap");
var point = new BMap.Point(120.018158, 30.295574);
map.centerAndZoom(point, 17);

 
map.addControl(new BMap.NavigationControl());   
map.addControl(new BMap.ScaleControl());    
map.addControl(new BMap.OverviewMapControl());    
map.addControl(new BMap.MapTypeControl());
map.enableScrollWheelZoom();
map.setCurrentCity("杭州"); 

var marker = new BMap.Marker(point);// 创建标注    
map.addOverlay(marker);
marker.enableDragging();    
marker.addEventListener("dragend", function(e){    
 alert("当前位置：" + e.point.lng + ", " + e.point.lat);    
})

var data_info = [   [120.013568,30.295262,"田径场"],
					[120.012472,30.294794,"看台"],
					[120.015454,30.29548,"小足球场"],
					[120.012849,30.296743,"风雨篮球场"],
					[120.011591,30.295636,"校门"],
					[120.020125,30.294124,"校门"],
					[120.022286,30.298786,"图书馆"],
					[120.015616,30.296915,"博文苑10号楼"],
					[120.015813,30.296494,"博文苑9号楼"],
					[120.014807,30.296526,"博文苑8号楼"],
					[120.014969,30.296057,"博文苑7号楼"],
					[120.016406,30.296166,"博文苑6号楼"],
					[120.016712,30.295652,"博文苑5号楼"],
					[120.015849,30.294982,"博文苑4号楼"],
					[120.016119,30.294561,"博文苑3号楼"],
					[120.017143,30.295262,"博文苑2号楼"],
					[120.017466,30.294607,"博文苑1号楼"],
					[120.018275,30.295169,"恕园8号楼(食堂)"],
					[120.019083,30.295371,"恕园7号楼"],
					[120.01682,30.293625,"恕园6号楼(食堂)"],
					[120.017377,30.293812,"恕园5号楼(食堂)"],
					[120.018059,30.294062,"恕园4号楼"],
					[120.018778,30.294264,"恕园3号楼"],
					[120.020539,30.295668,"恕园2号楼"],
					[120.02079,30.294763,"恕园1号楼"],
					[120.014329,30.297254,"恕园38号楼"],
					[120.017055,30.297796,"恕园37号楼"],
					[120.016512,30.297535,"恕园36号楼"],
					[120.017491,30.297979,"恕园35号楼"],
					[120.0179,30.298147,"恕园34号楼"],
					[120.017244,30.297484,"恕园33号楼"],
					[120.017819,30.297714,"恕园32号楼"],
					[120.018335,30.298322,"恕园31号楼"],
					[120.018383,30.297928,"恕园30号楼"],
					[120.019315,30.297917,"恕园29号楼"],
					[120.019777,30.298014,"恕园28号楼"],
					[120.020413,30.297897,"恕园27号楼"],
					[120.017572,30.297246,"恕园26号楼"],
					[120.017055,30.297075,"恕园25号楼"],
					[120.017491,30.296895,"恕园24号楼"],
					[120.018347,30.297414,"恕园23号楼"],
					[120.019126,30.297542,"恕园22号楼"],
					[120.019546,30.29739,"恕园21号楼"],
					[120.020107,30.297749,"恕园20号楼"],
					[120.017772,30.29665,"恕园19号楼"],
					[120.018163,30.29642,"恕园18号楼"],
					[120.019726,30.297094,"恕园17号楼"],
					[120.02061,30.297383,"恕园16号楼"],
					[120.02081,30.297145,"恕园15号楼"],
					[120.019355,30.296677,"恕园14号楼"],
					[120.019099,30.296447,"恕园13号楼(一鸣真鲜奶吧)"],
					[120.019824,30.296775,"恕园12号楼"],
					[120.019964,30.296307,"恕园11号楼"],
					[120.020437,30.296966,"恕园10号楼"],
					[120.020599,30.296794,"恕园9号楼"]
					];
var opts = {width : 345, height: 235};
for(var i = 0;i <= data_info.length;i++)
{
	var marker = new BMap.Marker(new BMap.Point(data_info[i][0],data_info[i][1]));
	var imgaddress="<img style='width:330px;height:154px' src='picture/pic.jpg' />";
	var title="<h4 style='margin:0 0 5px 0;padding:0.2em 0'>"+data_info[i][2]+"</h4>";
	var content=imgaddress+title;
	map.addOverlay(marker);
	addevent(content,marker);
}
function addevent(content,marker){
	marker.addEventListener("click",function(e){ 
		var infoWindow = new BMap.InfoWindow(content,opts); 
		this.openInfoWindow(infoWindow,marker);
	});
}